02_Data/BoR_SST/SST_MediumBody/0_orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedGradient;
        gradient        uniform -0.02;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    pipe
    {
        type            zeroGradient;
    }

    BoR
    {
        type            zeroGradient;
    }

    wedge0
    {
        type            wedge;
    }

    wedge1
    {
        type            wedge;
    }
}

// ************************************************************************* //
