02_Data/BoR_SST/SST_MediumBody/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (p U k epsilon omega R);
probeLocations
(
    (-1 0.8 0)
    (0 0.8 0)
    (4 0.8 0)
    (8 0.8 0)
    (12 0.8 0)
    (16 0.8 0)
);

// ************************************************************************* //
